app/controllers/comments_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "body", "rating", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["body", "sgdfhgdhg"], ["rating", 3], ["product_id", 2], ["created_at", "2017-12-05 04:46:26.892452"], ["updated_at", "2017-12-05 04:46:26.892452"]]
---
def create
		@product = Product.find(params[:product_id])
		@comment = @product.comments.new(comment_params)
		@comment.user = current_user
		@user = current_user

		respond_to do |format|
      if @comment.save