app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (name LIKE '%%')
SELECT MAX("products"."updated_at") FROM "products"
---
  def index
    if params[:q]
      search_term = params[:q]
      @products = Product.search(search_term)

SELECT  "comments".* FROM "comments" WHERE "comments"."product_id" = ? ORDER BY created_at DESC LIMIT ? OFFSET ?  [["product_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) AS "size", MAX(subquery_for_cache_key.updated_at) AS timestamp FROM (SELECT  "comments"."updated_at" FROM "comments" WHERE "comments"."product_id" = ? ORDER BY created_at DESC LIMIT ? OFFSET ?) subquery_for_cache_key  [["product_id", 2], ["LIMIT", 5], ["OFFSET", 0]]
---
  def show
    @comments = @product.comments.order("created_at DESC").paginate(:page => params[:page], :per_page => 5)

INSERT INTO "products" ("name", "description", "image_url", "created_at", "updated_at", "colour", "price") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "description" = ?, "colour" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["description", "Mix_carrot"], ["colour", "Red"], ["price", 50], ["updated_at", "2017-11-26 05:08:16.780595"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)