app/controllers/users_controller.rb

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Nermin"], ["last_name", "Mahdi"], ["updated_at", "2017-12-07 06:14:34.531653"], ["id", 1]]